InformationRegisters/Наследники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Наследники</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ДолговоеОбязательство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Наследник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/НБКИ_ТипыИзмененияДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>НБКИ_ТипыИзмененияДоговора</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОПрощении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МировоеСоглашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изменения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаследованиеДоговора</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/СведенияОбИзмененииДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СведенияОбИзмененииДоговора</Name>
			<BasedOn>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыПоДоговорам</xr:Item>
				<xr:Item>AccumulationRegister.НачисленияПоГоспошлине</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностьПоОбъектамВнесудебная</xr:Item>
				<xr:Item>AccumulationRegister.ИсковыеТребования</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностьПоСудебнымРешениям</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностьПоОбъектам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИзменения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НБКИ_ТипыИзмененияДоговора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзмененияДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИзменияДоговора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЛьготногоПериода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричиныУрегулированияПроблемнойЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидыПрочихИзмененийДоговора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеИныхИзменений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВступленияИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлановогоПрекращенияИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоПрекращенияИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричиныПрекращенияДействийИзмененияДоговора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричиныПрекращенияОбязательства</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПрекращенияОбязательства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДелоОНедееспособностиСубъекта</v8:Type>
						<v8:Type>cfg:DocumentRef.СудебноеДело</v8:Type>
						<v8:Type>cfg:CatalogRef.ДелоОБанкротстве</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеПрощение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписыватьЗадолженностьВПрограмме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументКорректировка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРегистров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПрекращенияОбязательства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наследник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Наследники/Ext/RecordSetModule.bsl
Процедура ПриЗаписи(Отказ, Замещение)
	Наследник = ЭтотОбъект.Отбор.Наследник.Значение;
	ДолговоеОбязательство = ЭтотОбъект.Отбор.ДолговоеОбязательство.Значение;
	
	МасивСобытий = Новый Массив;
	МасивСобытий.Добавить("2.5");
	МасивСобытий.Добавить("1.4");
	МасивСобытий.Добавить("2.2");
	МасивСобытий.Добавить("2.3");
	
	ДокИзменение = ПолучитьДокументНБКИИзменение(ДолговоеОбязательство, Наследник);
	
	Если ДокИзменение = Документы.СведенияОбИзмененииДоговора.ПустаяСсылка() Тогда
		МасивСобытий.Вставить(2, "2.1");
	КонецЕсли;	
	Часы = 12;
	Секунды = 3600;
	ДатаСобытияИзменения = ?(ЗначениеЗаполнено(ДокИзменение.ДатаИзмененияДоговора), ДокИзменение.ДатаИзмененияДоговора, НачалоДня(ТекущаяДатаСеанса())); 
	ДатаСобытияИзменения =  ДатаСобытияИзменения + (Часы * Секунды);
	Для Каждого НБКИСобытие из МасивСобытий Цикл
		СобытиеЗафиксировано = КредитныеИстории.СобытиеСделкиЗафиксированоИсточником(ДолговоеОбязательство, Наследник, НБКИСобытие);
		Если Не СобытиеЗафиксировано Тогда
			Если НБКИСобытие = "2.5" Тогда
				ДатаСобытия = НачалоДня(ДатаСобытияИзменения);
			ИначеЕсли НБКИСобытие = "2.2" Тогда 
				ДатаСобытия = ДатаСобытияИзменения + 2;
			Иначе
				ДатаСобытия = ДатаСобытия + 2;
			КонецЕсли;	
			КредитныеИстории.ЗаписатьСобытиеСделки(ДолговоеОбязательство, ДатаСобытия, Наследник, НБКИСобытие);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

Функция ПолучитьДокументНБКИИзменение(ДО, Наследник)
	
	ДокументНБКИИзменение = Документы.СведенияОбИзмененииДоговора.ПустаяСсылка();
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияОбИзмененииДоговора.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СведенияОбИзмененииДоговора КАК СведенияОбИзмененииДоговора
		|ГДЕ
		|	СведенияОбИзмененииДоговора.ОбъектУчета = &ОбъектУчета
		|	И СведенияОбИзмененииДоговора.ТипИзменения = ЗНАЧЕНИЕ(Перечисление.НБКИ_ТипыИзмененияДоговора.НаследованиеДоговора)
		|	И СведенияОбИзмененииДоговора.Наследник = &Наследник
		|	И НЕ СведенияОбИзмененииДоговора.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Наследник", Наследник);
	Запрос.УстановитьПараметр("ОбъектУчета", ДО);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокументНБКИИзменение = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат ДокументНБКИИзменение;
КонецФункции
